# Выполнить логические побитовые операции «И», «ИЛИ» и др. над числами 5 и 6.
# Выполнить над числом 5 побитовый сдвиг вправо и влево на два знака.

# вывод значений
# логические операции
print(f'Побитовая операция "Логическая AND" 5 & 6 = {5 & 6} или {bin(5 & 6)}')
print(f'Побитовая операция "Логическая OR" 5 | 6 = {5 | 6} или {bin(5 | 6)}')
print(f'Побитовая операция "Логическая XOR" 5 ^ 6 = {5 ^ 6} или {bin(5 ^ 6)}\n')

# побитовые сдвиги
print(f'Побитовая операция сдвиг влево 5 << 2 = {5 << 2} или {bin(5 << 2)}')
print(f'Побитовая операция сдвиг вправо 5 >> 2 = {5 >> 2} или {bin(5 >> 2)}')