# По введенным пользователем координатам двух точек вывести уравнение прямой
# вида y = kx + b, проходящей через эти точки.

# запрос координат
print('Введите координаты первой точки')
X1 = int(input('X: '))
Y1 = int(input('Y: '))

# запрос координат
print('Введите координаты второй точки')
X2 = int(input('X: '))
Y2 = int(input('Y: '))

# расчет коэффтцтентов
K =  f'{abs(Y1 - Y2)}/{abs(X2 - X1)}' if not ((Y1 - Y2)%(X2 - X1)) == 0 else abs((Y1 - Y2)//(X2 - X1))
C =  f'{abs(X1*X2 - X2*Y1)}/{abs(X2 - X1)}' if not ((X1*X2 - X2*Y1)%(X2 - X1)) == 0 else abs((X1*X2 - X2*Y1)//(X2 - X1))

# вывод результирующей формулы
print(f'Функция вида: Y = {("" if ((Y1 - Y2)//(X2 - X1)) >= 0 else "-")} {K}X {("+" if (X1*X2 - X2*Y1)//(X2 - X1) >= 0 else "-")} {C}')

# формула с сайта
# http://www.math.by/geometry/eqline.html
