let mode = "normal"
// самое стандартное объявление имени переменной

let my_valu3 = 102
// правильное объявление переменной
// использовать спецсимвол "_" разрешено в объявлении имени переменной
// использовать цифровые значения разрешено в объявлении имени переменной, если они находятся не в начале имени

let 3my_value3 = "102"
// неправильное объявление переменной - имя переменной начинается с цифры
// использовать спецсимвол "_" разрешено в объявлении имени переменной
// использовать цифровые значения разрешено в объявлении имени переменной, не в начале имени

let __hello__ = "world"
// правильное объявление переменной
// использовать спецсимвол "_" разрешено в объявлении имени переменной

let $$$ = "money"
// правильное объявление переменной
// использовать спецсимвол "$" разрешено в объявлении имени переменной

let!0_world = true;
// неправильное объявление переменной - имя переменной начинается с цифры
// неправильное объявление переменной - использвание знака "!" в имени переменной
// использовать спецсимвол "!" запрещено в объявлении имени переменной
// использовать цифровые значения разрешено в объявлении имени переменной, не в начале имени